{
    "locales": {
        "en": {
            "title": "Welcome!",
            "title_menu": "About me",
            "title_long_prefix": "Hello...",
            "title_long": "I'm **Maximiliano Rodriguez**"
        },

        "es": {
            "title": "¡Saludos!",
            "title_menu": "Sobre mí",
            "title_long_prefix": "Hola...",
            "title_long": "Soy **Maximiliano Rodriguez**"
        },

        "fr": {
            "title": "Salut !",
            "title_menu": "À propos",
            "title_long_prefix": "Salut...",
            "title_long": "Je suis **Maximiliano Rodriguez**"
        },

        "ko": {
            "title": "환영합니다!",
            "title_menu": "소개",
            "title_long_prefix": "안녕하세요...",
            "title_long": "저는 **Maximiliano Rodriguez** 입니다!"
        }
    },

    "articles": [
        {
            "id": "contact_list",
            "component": "ArticleGrid",
            "config": {
                "ignorePaddingTop": true,
                "format": "inline"
            },
            "locales": {
                "en": {},
                "es": {},
                "fr": {},
                "ko": {}
            },

            "items": [
                {
                    "value": "San Francisco, Cba, Argentina",
                    "links": [
                        {"href": null}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-city",
                        "faColors": {"bg": null, "fill": null}
                    }
                },
                {
                    "value": "maxi.rodriguez94@gmail.com",
                    "links": [
                        {"href": "mailto:maxi.rodriguez94@gmail.com"}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-envelope",
                        "faColors": {"bg": null, "fill": null}
                    }
                },
                {
                    "value": "@maxirodriguez94",
                    "links": [
                        {"href": "https://github.com/maxirodriguez94"}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-brands fa-github",
                        "faColors": {"bg": null, "fill": null}
                    }
                }
            ]
        },

        {
            "id": "short_description",
            "component": "ArticleInfoBlock",
            "config": {},
            "locales": {
                "en": {"title": "**A little bit** about me..."},
                "es": {"title": "**Un poco** sobre mí..."},
                "fr": {"title": "**Un peu** à propos de moi..."},
                "ko": {"title": "저에 **대해 조금**..."}
            },

            "items": [
                {
                    "icon": {
                        "img": "images/svg/logo.svg",
                        "fa": null,
                        "faColors": {"bg": null, "fill": null}
                    },
                    "locales": {
                    "en": {
                        "text": "Software Backend Developer | Passionate about Technological Innovation and Scalable Solutions. With over 3 years of experience, I specialize in backend development, designing scalable and efficient solutions. Currently, I work at Oblek, contributing to high-impact projects using technologies like Node.js, NestJS, PHP, and Laravel. My focus is on optimizing processes through automated testing, design patterns, and integrating tools like Firebase to ensure robust, high-performance applications. I also have experience in service-oriented architectures (microservices, RESTful APIs) and exploring emerging technologies like artificial intelligence to create innovative solutions that add value. I am motivated by technological challenges, collaborating with diverse teams, and staying updated on the latest trends to continue growing professionally and contributing to the success of the projects I participate in."
                    },
                    "es": {
                        "text": "Desarrollador de Software Backend | Apasionado por la Innovación Tecnológica y Soluciones Escalables. Con más de 3 años de experiencia, me he especializado en el desarrollo backend, diseñando soluciones escalables y eficientes. Actualmente, trabajo en Oblek, donde contribuyo al desarrollo de proyectos de alto impacto mediante tecnologías como Node.js, NestJS, PHP y Laravel. Mi enfoque está en optimizar procesos mediante la implementación de pruebas automatizadas, patrones de diseño y la integración de herramientas como Firebase para garantizar aplicaciones robustas y de alto rendimiento. Además, tengo experiencia en arquitecturas orientadas a servicios (microservicios, RESTful APIs) y en la exploración de tecnologías emergentes como inteligencia artificial, para crear soluciones innovadoras que añadan valor. Me motiva enfrentar desafíos tecnológicos, colaborar con equipos diversos y mantenerme actualizado en las últimas tendencias para seguir creciendo como profesional y contribuir al éxito de los proyectos en los que participo."
                    },
                    "fr": {
                        "text": "Développeur Backend | Passionné par l'Innovation Technologique et les Solutions Scalables. Avec plus de 3 ans d'expérience, je me suis spécialisé dans le développement backend, concevant des solutions évolutives et efficaces. Actuellement, je travaille chez Oblek, où je contribue à des projets à fort impact en utilisant des technologies telles que Node.js, NestJS, PHP et Laravel. Mon objectif est d'optimiser les processus grâce à des tests automatisés, des modèles de conception et l'intégration d'outils tels que Firebase pour garantir des applications robustes et performantes. J'ai également de l'expérience dans les architectures orientées services (microservices, API RESTful) et dans l'exploration de technologies émergentes comme l'intelligence artificielle pour créer des solutions innovantes qui ajoutent de la valeur. Je suis motivé par les défis technologiques, la collaboration avec des équipes diverses et le fait de rester à jour avec les dernières tendances pour continuer à progresser professionnellement et contribuer au succès des projets auxquels je participe."
                    },
                    "ko": {
                        "text": "소프트웨어 백엔드 개발자 | 기술 혁신 및 확장 가능한 솔루션에 대한 열정. 3년 이상의 경험을 바탕으로 백엔드 개발에 전문화되어 있으며, 확장 가능하고 효율적인 솔루션을 설계합니다. 현재 Oblek에서 Node.js, NestJS, PHP, Laravel 등의 기술을 사용하여 고효율 프로젝트 개발에 기여하고 있습니다. 저는 자동화된 테스트, 디자인 패턴을 활용하여 프로세스를 최적화하고 Firebase와 같은 도구를 통합하여 견고하고 고성능의 애플리케이션을 보장합니다. 또한 서비스 지향 아키텍처(마이크로서비스, RESTful API) 및 인공지능과 같은 최신 기술을 탐색하여 혁신적인 솔루션을 창출하고 있습니다. 기술적 도전 과제를 해결하고 다양한 팀과 협업하며 최신 트렌드를 유지하여 전문적으로 성장하고 참여하는 프로젝트의 성공에 기여하는 것이 제 동기입니다."
                    }
                            }
                }
            ]
        },

        

        
        {
            "id": "interests",
            "component": "ArticleGrid",
            "config": {
                "format": "grid"
            },
            "locales": {
                "en": {"title": "Personal **interests**"},
                "es": { "title": "Intereses **personales**" },
                "fr": { "title": "Intérêts **personnels** " },
                "ko": { "title": "개인 **관심사**" }
            },
            "items": [
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-gamepad",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Gaming",
                            "info": "Exploring different video games and enhancing my skills."
                        },
                        "es": {
                            "title": "Gaming",
                            "info": "Explorando diferentes videojuegos y mejorando mis habilidades."
                        },
                        "fr": {
                            "title": "Jeux vidéo",
                            "info": "Explorer différents jeux vidéo et améliorer mes compétences."
                        },
                        "ko": {
                            "title": "게임",
                            "info": "다양한 비디오 게임을 탐험하고 기술을 향상시키기."
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-futbol",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Football",
                            "info": "Passionate about playing and watching football games."
                        },
                        "es": {
                            "title": "Fútbol",
                            "info": "Apasionado por jugar y ver partidos de fútbol."
                        },
                        "fr": {
                            "title": "Football",
                            "info": "Passionné par jouer et regarder des matchs de football."
                        },
                        "ko": {
                            "title": "축구",
                            "info": "축구 경기를 하는 것과 보는 것을 좋아함."
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-dumbbell",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Gym",
                            "info": "Keeping fit by working out at the gym."
                        },
                        "es": {
                            "title": "Gimnasio",
                            "info": "Mantenerse en forma entrenando en el gimnasio."
                        },
                        "fr": {
                            "title": "Salle de sport",
                            "info": "Rester en forme en m'entraînant à la salle de sport."
                        },
                        "ko": {
                            "title": "헬스장",
                            "info": "헬스장에서 운동하며 건강을 유지하기."
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-book",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Reading",
                            "info": "Enjoying books on various topics, especially technology and history."
                        },
                        "es": {
                            "title": "Leer",
                            "info": "Disfrutando de libros sobre diversos temas, especialmente tecnología e historia."
                        },
                        "fr": {
                            "title": "Lecture",
                            "info": "J'apprécie les livres sur divers sujets, en particulier la technologie et l'histoire."
                        },
                        "ko": {
                            "title": "독서",
                            "info": "다양한 주제의 책을 즐기며 특히 기술과 역사에 관한 책을 좋아함."
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-flask",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Research",
                            "info": "Engaging in scientific and technological research to expand knowledge."
                        },
                        "es": {
                            "title": "Investigación",
                            "info": "Participando en investigaciones científicas y tecnológicas para expandir el conocimiento."
                        },
                        "fr": {
                            "title": "Recherche",
                            "info": "M'engager dans la recherche scientifique et technologique pour élargir les connaissances."
                        },
                        "ko": {
                            "title": "연구",
                            "info": "과학 및 기술 연구에 참여하여 지식을 확장하기."
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-robot",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "AI",
                            "info": "Exploring the field of Artificial Intelligence and its potential applications."
                        },
                        "es": {
                            "title": "IA",
                            "info": "Explorando el campo de la Inteligencia Artificial y sus aplicaciones potenciales."
                        },
                        "fr": {
                            "title": "IA",
                            "info": "Explorer le domaine de l'intelligence artificielle et ses applications potentielles."
                        },
                        "ko": {
                            "title": "인공지능",
                            "info": "인공지능 분야와 그 잠재적 응용을 탐구하기."
                        }
                    }
                }
            ]
        }
    ]
}
